{
  "version": "https://jsonfeed.org/version/1",
  "title": "домашняя страница n06rin",
  "home_page_url": "https://n06rin.github.io/",
  "feed_url": "https://n06rin.github.io/feed/feed.json",
  "description": "мои проекты и посты на разные темы",
  "author": {
    "name": "Ермаков Николай, n06rin, erman",
    "url": "https://n06rin.github.io/about-me/"
  },
  "items": [{
      "id": "https://n06rin.github.io/posts/Ori%20and%20the%20blind%20forest%20-%20%D1%82%D0%B0%D0%BA%D0%B0%D1%8F%20%D1%81%D0%B5%D0%B1%D0%B5%20%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B0,%20%D1%82%D0%B0%D0%BA%D0%B0%D1%8F%20%D1%81%D0%B5%D0%B1%D0%B5%20%D0%B8%D0%B3%D1%80%D0%B0/",
      "url": "https://n06rin.github.io/posts/Ori%20and%20the%20blind%20forest%20-%20%D1%82%D0%B0%D0%BA%D0%B0%D1%8F%20%D1%81%D0%B5%D0%B1%D0%B5%20%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B0,%20%D1%82%D0%B0%D0%BA%D0%B0%D1%8F%20%D1%81%D0%B5%D0%B1%D0%B5%20%D0%B8%D0%B3%D1%80%D0%B0/",
      "title": "Ori and the blind forest - такая себе сказка, такая себе игра",
      "content_html": "<p>Ори лежал у меня непройденным где-то год. Дойдя почти до середины я оставил эту игру пылиться на полке своей коллекции в стиме.</p>\n<p>Однако давеча, я купил себе xbox-контроллер, подключил компьютер к телевизору и встал вопрос во что играть. Решил допройти Ори. Игру я начал сначала, и за неделю добив, хотелось бы поделиться своими впечатлениями от нее.</p>\n<h3 id=\"%D0%BC%D0%B0%D1%81%D1%82%D0%B5%D1%80%D1%81%D1%82%D0%B2%D0%BE-%D0%B8%D0%BB%D0%BB%D1%8E%D0%B7%D0%B8%D0%B8\">Мастерство иллюзии <a class=\"direct-link\" href=\"#%D0%BC%D0%B0%D1%81%D1%82%D0%B5%D1%80%D1%81%D1%82%D0%B2%D0%BE-%D0%B8%D0%BB%D0%BB%D1%8E%D0%B7%D0%B8%D0%B8\">#</a></h3>\n<p>Концептуально Ори хочет выглядеть по-детски наивной историей. Обезоруживать весь скепсис игроков по-отношению к ней. И как мне кажется перебарщивает с этим.</p>\n<p>Трогательная история про маленькое существо- по-детски мило выглядящее, хрупкое, с тяжелой судьбой потерянной сироты и обретшей семейное тепло в руках большого и доброго монстра кормящего его яблочками. А потом трагическая потеря опекуна и вот уже наш зверек идет спасать мир. Яркая красочная графика и трогательная музыка- все должно обезоруживать.</p>\n<p>И этот кредит доверия тянул меня до-середины игры. А потом он заканчивается и я остался один на один с не самым удачным платформером. И если бы не волевое решение дойти игру до конца, я бы снова бросил Ори.</p>\n<h3 id=\"%D1%81%D0%BC%D0%B5%D1%80%D1%82%D1%8C-%D1%80%D0%B0%D0%B7%D1%80%D1%83%D1%88%D0%B0%D1%8E%D1%89%D0%B0%D1%8F-%D0%B2%D0%B5%D1%80%D1%83\">Смерть разрушающая веру <a class=\"direct-link\" href=\"#%D1%81%D0%BC%D0%B5%D1%80%D1%82%D1%8C-%D1%80%D0%B0%D0%B7%D1%80%D1%83%D1%88%D0%B0%D1%8E%D1%89%D0%B0%D1%8F-%D0%B2%D0%B5%D1%80%D1%83\">#</a></h3>\n<p>Авторы игры со временем повышая сложность уровней сами разрушают образ главного героя. Местами персонаж погибает слишком часто. Из-за этого я перестал относиться к персонажу так, как его представили в начале игры. Нет, это никакой не особенный герой, это очередной игровой аватар которым приходится управлять.</p>\n<p>В какой-то момент я понял что закосячив прыжок, проще не спасать персонажа, а наоборот, прыгнуть в ту же лаву или на иглы, чтобы начать с последнего сохранения. Видеть страдания и смерть героя приходится слишком часто. Это убивает веру к происходящему.</p>\n<h3 id=\"%D0%B7%D0%B0%D1%81%D0%BA%D1%80%D0%B8%D0%BF%D1%82%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D1%8C\">Заскриптованность <a class=\"direct-link\" href=\"#%D0%B7%D0%B0%D1%81%D0%BA%D1%80%D0%B8%D0%BF%D1%82%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D1%8C\">#</a></h3>\n<p>Разработчики для создания цельной истории используют как полноценные кат-сцены, так и условно интерактивные игровые челленджи. Например игровое пространство затапливает, вода бурлит и поднимается. И игроку надо совершить побег из затапливаемой локации. И переживается это очень классно. Выглядит это по-настоящему кинематографично. До первой смерти. Потом иллюзия опасности растворяется и переживая этот “смертельно опасный” побег снова и снова ты видишь заскриптованность. И на место впечатлению приходит раздражение. И так со всеми подобными игровыми моментами.</p>\n<h3 id=\"%D1%81%D0%BB%D0%B8%D1%88%D0%BA%D0%BE%D0%BC-%D0%BC%D0%BD%D0%BE%D0%B3%D0%BE-%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9\">Слишком много возможностей <a class=\"direct-link\" href=\"#%D1%81%D0%BB%D0%B8%D1%88%D0%BA%D0%BE%D0%BC-%D0%BC%D0%BD%D0%BE%D0%B3%D0%BE-%D0%B2%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D0%B5%D0%B9\">#</a></h3>\n<p>Платформеры один из старейших и до сих пор живых жанров видеоигр. И за годы его жизни были придуманы сотни различных механик и фишек, способностей персонажей и идей для уровней. Придумать что-то новое кажется уже невозможным, но есть огромный простор в оттачивании механик. Хочется вспомнить недавную celeste или теперь уже классику во-плоти- super meat boy. В этих платформерах используется идея разумного минимализма. Есть ограниченный набор возможностей, а уровни представляют собой головоломку + упражнение на ловкость рук.</p>\n<p>В Ори же по-ходу игры приходится осваивать новые и новые фишки. По-сути, прохождение нового куска карты начинается с изучения новой возможности и применения ее на практике. И к концу второй трети игры я начал путаться в управлении персонажем. Lо самого конца игры возникали подобные затупы, которые решались только быстро выработанной мышечной памятью прохождения того или иного куска карты.</p>\n<h3 id=\"%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B8-%D1%81%D0%BB%D0%BE%D0%B6%D0%BD%D1%8B%D0%B5%2C-%D0%BD%D0%BE-%D0%BD%D0%B5-%D1%82%D0%B0%D0%BA-%D0%BA%D0%B0%D0%BA-%D1%85%D0%BE%D1%82%D0%B5%D0%BB%D0%BE%D1%81%D1%8C\">Уровни сложные, но не так как хотелось <a class=\"direct-link\" href=\"#%D1%83%D1%80%D0%BE%D0%B2%D0%BD%D0%B8-%D1%81%D0%BB%D0%BE%D0%B6%D0%BD%D1%8B%D0%B5%2C-%D0%BD%D0%BE-%D0%BD%D0%B5-%D1%82%D0%B0%D0%BA-%D0%BA%D0%B0%D0%BA-%D1%85%D0%BE%D1%82%D0%B5%D0%BB%D0%BE%D1%81%D1%8C\">#</a></h3>\n<p>Уровень в компьютерной игре это по-сути головоломка которую надо решить. Для решения уровня, игроку приходится использовать множество навыков. И печально что в Ори дизайнеры уровней сделали слишком много мест, которые проходить надо исключительно при помощи поиска удачных таймингов и мышечной памяти. Несколько раз за игру я застревал в некоторых участках на 20+ минут которые можно пройти только начав прохождение в удачный момент и выученной комбинацией движений.</p>\n<p>Главный герой которого нам так мило представляли, умирает раз за разом на иглах или в огне, пока я уже думаю о каких-то житейских вещах, а руки на автомате проходят кусок игры раз за разом пока не получится. Использовать здесь выдумку и смекалку к сожалению бесполезно. И от прохождения подобных проблемых мест радости также нет. Это становится рутиной.</p>\n<p>Отсюда же и проблемы со сложностью. В начале игры её можно выбрать, якобы легкий уровень сложности можно выбрать если интересно следить за сюжетом. Да, npc умирают проще, но от прохождения вышеупомянутых участков карт это не спасает.</p>\n<h3 id=\"%D1%81%D0%B0%D0%BC%D0%B0%D1%8F-%D0%B1%D0%BE%D0%BB%D1%8C%D1%88%D0%B0%D1%8F-%D0%BF%D1%80%D0%BE%D0%B1%D0%BB%D0%B5%D0%BC%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%B2%D0%BE%D0%B3%D0%BE-%D0%BC%D0%B8%D1%80%D0%B0--%D1%81%D0%B0%D0%BC-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA\">Самая большая проблема игрового мира- сам игрок <a class=\"direct-link\" href=\"#%D1%81%D0%B0%D0%BC%D0%B0%D1%8F-%D0%B1%D0%BE%D0%BB%D1%8C%D1%88%D0%B0%D1%8F-%D0%BF%D1%80%D0%BE%D0%B1%D0%BB%D0%B5%D0%BC%D0%B0-%D0%B8%D0%B3%D1%80%D0%BE%D0%B2%D0%BE%D0%B3%D0%BE-%D0%BC%D0%B8%D1%80%D0%B0--%D1%81%D0%B0%D0%BC-%D0%B8%D0%B3%D1%80%D0%BE%D0%BA\">#</a></h3>\n<p>Как я писал выше, история в Ори пытается быть простой и по-детски наивной дабы обезоружить игрока. Главной мотивацией игрока должна стать починка мира- только вот во время этой самой починки мы устраиваем очередной геноцид “плохих” существ. И возникает вопрос- тот мир что был раньше- погиб. Заняли его новые существа- пусть и агрессивные к главному герою. Но стоит ли их лишать жизни? Игра таких вопросов перед игроком не ставит- беги вперед и зачищай уровень.</p>\n<h3 id=\"%D0%B8-%D0%BD%D0%B8-%D1%82%D1%83%D0%B4%D1%8B-%D0%B8-%D0%BD%D0%B8-%D1%81%D1%8E%D0%B4%D1%8B\">И ни туды и ни сюды <a class=\"direct-link\" href=\"#%D0%B8-%D0%BD%D0%B8-%D1%82%D1%83%D0%B4%D1%8B-%D0%B8-%D0%BD%D0%B8-%D1%81%D1%8E%D0%B4%D1%8B\">#</a></h3>\n<p>Все это к сожалению, не оставляет у меня желания возвращаться в игру снова. Атмосферу сказочной истории убивает плохой геймплейный опыт.</p>\n<p>Да, и самое смешное, как по-мне, это прекраснейшая визуальная составляющая игры. Она выглядит действительно впечатляюще и игру стоит проходить на большом экране. А смешно это потому, что после перечисления всего что написано выше, визуал как-то смазывается в памяти.</p>\n",
      "date_published": "2019-01-02T00:00:00Z"
    },{
      "id": "https://n06rin.github.io/posts/%D0%9C%D0%B5%D1%81%D1%81%D0%B5%D0%BD%D0%B4%D0%B6%D0%B5%D1%80%D0%BD%D0%B0%D1%8F-%D0%B2%D0%B5%D1%82%D0%B2%D1%8C-%D1%8D%D0%B2%D0%BE%D0%BB%D1%8E%D1%86%D0%B8%D0%B8/",
      "url": "https://n06rin.github.io/posts/%D0%9C%D0%B5%D1%81%D1%81%D0%B5%D0%BD%D0%B4%D0%B6%D0%B5%D1%80%D0%BD%D0%B0%D1%8F-%D0%B2%D0%B5%D1%82%D0%B2%D1%8C-%D1%8D%D0%B2%D0%BE%D0%BB%D1%8E%D1%86%D0%B8%D0%B8/",
      "title": "Мессенджерная ветвь эволюции",
      "content_html": "<blockquote>\n<p>tl;dr Развитие мессенджеров в комбайны возможно только если что-то мешает развитию интернета, либо у конечного пользователя очень слабое устройство.</p>\n</blockquote>\n<p>В принципе, 2017 год подходит к концу. И если бы к году можно было прикрепить какие-либо теги, то я бы прицепил: блокчейн, биткоин, мессенджеры, телеграм. О последних двух хотелось бы поговорить сейчас.</p>\n<p>Вообще, я недавно натолкнулся на статью в мобайлревью о размышлениях <a href=\"http://mobile-review.com/articles/2017/messengers.shtml\">почему мессенджеры это будущее</a>. С ней я был категорически не согласен. И даже начал писать развернутый ответ. Но потом пыл остыл и я оставил эту тему. Но тема у всех на языках и я чувствую необходимость рассказать что думаю.</p>\n<h3 id=\"%D0%BD%D0%B5-%D0%BE%D1%87%D0%B5%D0%BD%D1%8C-%D0%BA%D1%80%D0%B0%D1%82%D0%BA%D0%B8%D0%B9-%D0%B8%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9-%D1%8D%D0%BA%D1%81%D0%BA%D1%83%D1%80%D1%81\">Не очень краткий исторический экскурс <a class=\"direct-link\" href=\"#%D0%BD%D0%B5-%D0%BE%D1%87%D0%B5%D0%BD%D1%8C-%D0%BA%D1%80%D0%B0%D1%82%D0%BA%D0%B8%D0%B9-%D0%B8%D1%81%D1%82%D0%BE%D1%80%D0%B8%D1%87%D0%B5%D1%81%D0%BA%D0%B8%D0%B9-%D1%8D%D0%BA%D1%81%D0%BA%D1%83%D1%80%D1%81\">#</a></h3>\n<p>Мессенджеры появились даже раньше раньше того интернета к которому мы привыкли. Самый распростренный протокол <a href=\"https://ru.wikipedia.org/wiki/IRC\">IRC появился в 1988 году</a>. Впрочем ббс-ки уже тогда были. Как и фидо.</p>\n<p>И к слову сказать ирк до сих пор жив. Просто у нас он не прижился. Но для многих специфических вещей (разработка софта, какие-либо чаты для сообществ) ирк-каналы существуют до сих пор. И были боты, много ботов. Я помню как еще будучи школьником читал статью в Компьютерре про то как искать файлы в irc <a href=\"http://old.computerra.ru/2004/529/204443/\">статья</a>.</p>\n<p>Но ирк я практически не застал. Заходил туда через <a href=\"https://www.pidgin.im/\">pidgin</a>. Это мультипротокольный мессенджер. Сейчас такое разве что в крупных компаниях со своими чат-серверами можно встретить.<br>\nНо я застал аську. И jabber. Второй тоже был очень любопытной штукой, о которой бы хотелось рассказать.</p>\n<p>Был такой открытый протокол. Были jabber-сервера, на которых ты делал себе учетку и мог общаться с людьми как с этого сервера, так и с любого другого. Ближайшим аналогом будет то, как работает e-mail. Собственно говоря, так и адреса была формата <a href=\"mailto:nickname@jabber.ru\">nickname@jabber.ru</a>.</p>\n<p>На серверах были и чат-комнаты. Я даже сидел в нескольких на постоянной основе. Были и боты. Много ботов. На все случаи жизни, с разным функционалом. Были, хотя почему были, даже существует до сих пор сервис для микроблоггинга <a href=\"https://juick.com/\">Juick</a>. Хотя я думаю о таком мало кто даже слышал. В общем все там было.</p>\n<p>И Jabber во всяком случае раньше точно лежал под капотом разных &quot;незавимых&quot; сервисов. В вконтакте был собственный jabber сервер. Google hangouts или сервис им предшествующих тоже был основан на джаббере, тут я точно не помню.</p>\n<p>Был еще конечно же скайп. Он побледнее по функционалу, зато был более дружелюбен к конечному пользователю. Люди начали из него уходить лишь совсем недавно. Смерть скайпа это лишь темная точка на черном саване из управленческих провалов майкрософта. Жаль что никто особо не задумывался над смертью скайпа. Но видимо так и умирают продукты- незаметно. Над Jabber тоже никто не плакал. Хотя я бы назвал этот <a href=\"https://habrahabr.ru/post/316912/\">пост</a> некрологом</p>\n<h3 id=\"%D0%B2%D0%B7%D0%B3%D0%BB%D1%8F%D0%B4-%D0%BE%D0%B1%D1%8B%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8F\">Взгляд обывателя <a class=\"direct-link\" href=\"#%D0%B2%D0%B7%D0%B3%D0%BB%D1%8F%D0%B4-%D0%BE%D0%B1%D1%8B%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8F\">#</a></h3>\n<p>Но наверное все эти забавы с ирком, джаббером, все это были забавы для узкой прослойки людей. Большинство сразу пришли в социальные сети и не выходили извне. Где-то по-середине были пользователи аськи. Я просто помню что все мои одноклассники сидели вконтакте, а аська была только у пары человек.</p>\n<p>Если надо было что-то перекинуть (музыку или картинки), то для этого использоватлся ик-порт, а у кого были устройства подороже, те использовали bluetooth.</p>\n<p>С приходом смартфонов вконтакте уже активно использовался для обмена музыкой, фото, общения.</p>\n<h3 id=\"here-we-go-again\">Here we go again <a class=\"direct-link\" href=\"#here-we-go-again\">#</a></h3>\n<p>Казалось бы соцсети должны были подмять под себя мессенджеры или как раньше говорилось интернет-пейджеры.</p>\n<p>Тут вспоминается каким вконтакт был раньше- медиа-комбайном с музыкой, фильмами, друзьями и играми. Люди смотрели там кинопремьеры, спускали зарплаты родителей на голоса, и деревнями уходили собирать урожай в веселую ферму. Там зародился SMM который и до сих пор прекрасно себя чувствует. Люди которые занимались вэбом в то время чувствовали угрозу. Я помню высказывание Артемия Лебедева что мол, соцсети это интернет для бедных. Помню его пренебрежительное отношение к твиттеру, где он писал исключительно о том что он сейчас почесал. Но ничего, сейчас они вполне себе занимаются <a href=\"https://www.artlebedev.ru/social-networks/\">оформлением для соцсетей</a></p>\n<p>Впрочем, он также говорил и про <a href=\"https://www.artlebedev.ru/kovodstvo/sections/177/\">мобильные версии сайтов</a>, а потом <a href=\"https://www.artlebedev.ru/kovodstvo/sections/182/\">переобувался</a>.</p>\n<p>Но краткий смысл в том, что раньше реально было ощущение что на соцсетях весь интернет закончится. Ибо все можно будет через соцсети.</p>\n<p>Что-то это напоминает, не так ли? Но я думаю что стоит рассказать почему мессенджеры во время бума соцсетей не умерли.</p>\n<blockquote>\n<p>11 лет: боялся, что люди из интернета найдут тебя в реале.<br>\n24: боишься, что люди из реальной жизни найдут тебя в интернете.</p>\n</blockquote>\n<p>Мессенджеры, или как раньше говорили, интернет-пейджеры, давали возможность написать человеку, и получить от него сообщение. Не больше и не меньше. Там нельзя было полайкать фоточки собеседника, ибо их не было. Зато очень легко связаться с человеком, достаточно знать его никнейм или уникальный номер. Не надо искать среди 80 Никит 20 лет из Новосибирска того кто нужен по аватарке или Маришка Иванова из Кемерово (я там одна такая ).</p>\n<p>Люди осознали что в соцсетях не только они видят всех, но и все видят их. Стало больше не прилично подписываться на группы интим знакомств или порно онлайн. Люди начали серьезно относиться к тому что они пишут и кому. Также в интернет пришли представители правохранительных органов. Теперь нас не удивляет что кому-то может грозить реальное заключение за репост картинки на стену своей страницы вконтакте.</p>\n<p>Соцсети стали слишком много знать о нас, и взлом страницы с доступом ко всем перепискам стал синонимом кражи личности. Уверен что на взломе страниц сделаны целые состояния.</p>\n<h3 id=\"%D1%80%D0%B5%D0%BD%D0%B5%D1%81%D0%B0%D0%BD%D1%81-%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82-%D0%BF%D0%B5%D0%B9%D0%B4%D0%B6%D0%B5%D1%80%D0%BE%D0%B2\">Ренесанс интернет-пейджеров <a class=\"direct-link\" href=\"#%D1%80%D0%B5%D0%BD%D0%B5%D1%81%D0%B0%D0%BD%D1%81-%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D0%BD%D0%B5%D1%82-%D0%BF%D0%B5%D0%B9%D0%B4%D0%B6%D0%B5%D1%80%D0%BE%D0%B2\">#</a></h3>\n<p>Изначально популярность мессенджеров была чисто прагматичной. Переписываться и не платить за смски. Скидывать друг-другу фотки и видео и не платить за ммс. А если еще по wi-fi то считай бесплатно.</p>\n<p>А потом пришел Сноуден и все поняли что за ними конечно же следит госдеп. После стольких лет разговоров о конфиденциальности и приватности люди поняли что эти слова не пустой звук и захотелось эту самую приватность ощущить. И тут гонимый кровавой гэбней Дуров словно Прометей с Олимпа приносит нам приватный мессенджер. И хоть тот же Сноуден <a href=\"https://vc.ru/18615-durov-snowden-wa\">высказал сомнения в надежности</a>, публике эти дискуссии не интересны. А вот образ сумрачного гения которого отыгрывает Дуров интересна вполне.</p>\n<h3 id=\"%D1%8D%D0%B9%D1%84%D0%BE%D1%80%D0%B8%D1%8F\">Эйфория <a class=\"direct-link\" href=\"#%D1%8D%D0%B9%D1%84%D0%BE%D1%80%D0%B8%D1%8F\">#</a></h3>\n<p>И сегодня телеграм это модно@молодежно. Телеграм имеет огромный кредит доверия. А <a href=\"https://www.vedomosti.ru/technology/articles/2017/09/27/735506-fsb-potrebovala-telegram\">конфликты с властями</a> играют только на руку, подогревая популярность и увеличивая кредит. Столичная богема увлекается каналами в телеграме и играет в анонимность с приватностью.</p>\n<p>Пользователи проглатывают абсолютно все и радуются как дети даже переизобретенным велосипедам. Некоторые пишут целые статьи о том что это наше светлое будущее.</p>\n<p>Но я вот вспоминаю что все это уже было. Было и в ирке и в джаббере. И никому это нафиг не надо было, кроме прослойки гиков, потому что это банально неудобно. Никто не будет в здравом уме заказывать через бота такси, когда есть убер, яндекс.такси и прости-господи гетт. Все эти боты с погодой в твоем городе надоедают почти сразу. Я не могу представить что народ будет перекидывать друг-другу деньги в мессенджере, когда у всех зарплатные карты в сбере. Никто не будет качать пиратский контент из телеграма, потому что для этого есть трекеры, которые тоже в свое время доживают последние дни- покупать контент сейчас гораздо удобнее.</p>\n<p>И тем более, удивительно что люди вкладывают миллионы в аналогичные продукты, такие как <a href=\"http://veon.ru/\">VEON</a>. И вполне открыто говорят о своих <a href=\"https://roem.ru/29-05-2017/250975/vympelkom-veon/\">намерениях создать аналог WeChat</a>. Не понимая очевидной вещи- рынок Китая практически закрыт от западных компаний. Он развивается обособленно от всего мира. Фауна Мадагаскара удивительна. Но она такая лишь потому что обособлена от континента. Российский же рынок принадлежит к общемировому. У нас да, могут поиграться с ботами в телеграме. Но когда речь заходит о практичности, то лучше использовать для одной конкретной задачи одно конкретное приложение.</p>\n<p>Для примера можете попробовать поработать с <a href=\"https://vk.com/gymbossbot\">&quot;первым тренером-ботом с искусственным интеллектом&quot;</a>, использовать которого практически физически больно.</p>\n<p>Можно сколь угодно воспевать удобство каналов в телеграме, но потом ты перестаешь их читать, отключаешь уведомления чтобы не мешали и лишь иногда раздраженно заходишь в канал чтобы сбросить уведомления. Тем временем фейсбук и инстаграм перешли к &quot;умной&quot; ленте, недавно такое внедрили во вконтакте. Просто листай, интересное само покажется. Ну должно во всяком случае. Наверное.</p>\n<h3 id=\"%D0%B0-%D1%87%D1%82%D0%BE-%D0%BF%D0%BE%D1%82%D0%BE%D0%BC%3F\">А что потом? <a class=\"direct-link\" href=\"#%D0%B0-%D1%87%D1%82%D0%BE-%D0%BF%D0%BE%D1%82%D0%BE%D0%BC%3F\">#</a></h3>\n<p>Мессенджеры останутся с нами и займут свою нишу как специфичные продукты. Как например Slack.</p>\n<p>Социальные сети уже перековались. Теперь они становятся площадками для пользовательского контента. Все эти умные ленты. <a href=\"https://vk.com/authors\">Вконтакте акцентируется на работе с авторами</a>. И я считаю это правильно.</p>\n<p>Стучитесь в аську! (ICQ: 558 057 885 )</p>\n",
      "date_published": "2017-12-03T21:49:29Z"
    }
  ]
}
